DataProcessors/РСК_ОтменаАктовПриСмертиПолучателяТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>РСК_ОтменаАктовПриСмертиПолучателяТСР</Name>
			<Comment>РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/РСК_СтатусыАктовВыдачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыАктовВыдачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗамена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеЭкспедитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоручениеЭкспедитору</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.РСК_СтатусыВыполненияКонтрактов</xr:Item>
				<xr:Item>InformationRegister.РСК_АктВыдачиТСР</xr:Item>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пункт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_АктВыдачиТСР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СтатусАктаВыдачиТСР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыАктовВыдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерЗаявки</Name>
					<Comment>РС Консалт: Трофимов Евгений 12.11.2022 Задача 21867</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РСК_ОтменаАктовПриСмертиПолучателяТСР/Ext/ObjectModule.bsl
// Аннулирование актов выдачи ТСР
//
// Параметры:
//  СтруктураПараметров	 - Структура - Ключи:
//		* Партнер - СправочникСсылка.Партнеры - Получатель ТСР, которому установили статус «Умер»
//  АдресХранилища		 - Строка - Адрес хранилища результатов выполнения процедуры
//
Процедура АннулированиеАктовВыдачиТСР(СтруктураПараметров, АдресХранилища = "") Экспорт

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Протокол", "");
	
    УстановитьПривилегированныйРежим(Истина);

	МассивСтатусовАктовВыдачи = Новый Массив;
	МассивСтатусовАктовВыдачи.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.ПустаяСсылка());
	МассивСтатусовАктовВыдачи.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.Создан);
	МассивСтатусовАктовВыдачи.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.Подготовлен);
	
	ДополнитьПротокол(СтруктураОтвета, "Получение списка Актов выдачи ТСР...", СтруктураПараметров.Партнер);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоручениеЭкспедитору.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|ГДЕ
		|	ПоручениеЭкспедитору.РСК_АктВыдачиТСР
		|	И ПоручениеЭкспедитору.РСК_СтатусАктаВыдачиТСР В(&МассивСтатусовАктовВыдачи)
		|	И ПоручениеЭкспедитору.Пункт = &Партнер";
	
	Запрос.УстановитьПараметр("МассивСтатусовАктовВыдачи", МассивСтатусовАктовВыдачи);
	Запрос.УстановитьПараметр("Партнер", СтруктураПараметров.Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДополнитьПротокол(СтруктураОтвета, "Акты выдачи ТСР с получателем "+СтруктураПараметров.Партнер+", статусы которых требуется изменить, не найдены.");
		ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	ДополнитьПротокол(СтруктураОтвета, СтрШаблон(
		"Найдено %1 Актов выдачи ТСР с получателем %2, статусы которых требуется изменить.",
		Выборка.Количество(),
		СтруктураПараметров.Партнер
	), СтруктураПараметров.Партнер);
	
	ё = 0;
	ПрошлыйПроцентВыполнения = 0;
	Пока Выборка.Следующий() Цикл
		ё = ё + 1;
		ПроцентВыполнения = ё * 100 / Выборка.Количество();
		Если ПрошлыйПроцентВыполнения <> Окр(ПроцентВыполнения) Тогда
			ПрошлыйПроцентВыполнения = Окр(ПроцентВыполнения);
			ДлительныеОперации.СообщитьПрогресс(ПрошлыйПроцентВыполнения, "Аннулирование актов выдачи ТСР ("+ё+" из "+Выборка.Количество()+")");
		КонецЕсли;
		
		Акт = Выборка.Ссылка.ПолучитьОбъект();
		Акт.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Аннулирован;
		Акт.Комментарий = Акт.Комментарий + ?(ПустаяСтрока(Акт.Комментарий),""," ") + "Получатель умер, поручение аннулировано.";
		
		Попытка
			Акт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ДополнитьПротокол(СтруктураОтвета, "Успешно скорректирован "+Выборка.Ссылка, Выборка.Ссылка);
		Исключение
			ДополнитьПротокол(СтруктураОтвета, "Не удалось скорректировать "+Выборка.Ссылка+". "+ОписаниеОшибки(), Выборка.Ссылка);
		КонецПопытки;
		
	КонецЦикла;
	ДополнитьПротокол(СтруктураОтвета, "Аннулирование актов выдачи ТСР завершено.", СтруктураПараметров.Партнер);

	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресХранилища);
	
КонецПроцедуры

Процедура ДополнитьПротокол(СтруктураОтвета, Текст="", СсылочныйОбъект = Неопределено)

	СтруктураОтвета.Протокол = СтруктураОтвета.Протокол
	+ ?(ПустаяСтрока(СтруктураОтвета.Протокол),"",Символы.ПС)
	+ Формат(ТекущаяДата(),"ДЛФ=T") + " " + Текст;

	Если ЗначениеЗаполнено(СсылочныйОбъект) Тогда
		ЗаписьЖурналаРегистрации(
			"Аннулирование актов выдачи ТСР",
			УровеньЖурналаРегистрации.Предупреждение,
			СсылочныйОбъект.Метаданные(),
			СсылочныйОбъект,
			Текст
		);
	Иначе
		ЗаписьЖурналаРегистрации("Аннулирование актов выдачи ТСР",УровеньЖурналаРегистрации.Предупреждение,,,Текст);
	КонецЕсли;
	
КонецПроцедуры
